In [2]:
import numpy as np
import pandas as pd

# Series

In [3]:
 myDict = {"aley": 20, "ali":40, "zeyno": 35}

In [4]:
pd.Series(myDict)

aley     20
ali      40
zeyno    35
dtype: int64

In [5]:
type(pd.Series(myDict))

pandas.core.series.Series

In [6]:
myAge = [50,40,30]
myName = ["aley","ali","zeyno"]

In [7]:
pd.Series(myAge)

0    50
1    40
2    30
dtype: int64

In [8]:
pd.Series(myAge,myName)

aley     50
ali      40
zeyno    30
dtype: int64

In [9]:
pd.Series(data = myAge, index= myName)

aley     50
ali      40
zeyno    30
dtype: int64

In [10]:
numpyArray = np.array([50,40,30])

In [11]:
numpyArray

array([50, 40, 30])

In [12]:
pd.Series(numpyArray)

0    50
1    40
2    30
dtype: int32

In [13]:
pd.Series(numpyArray,myName)

aley     50
ali      40
zeyno    30
dtype: int32

In [14]:
pd.Series(["Yigit","Osman","Aleyna"])

0     Yigit
1     Osman
2    Aleyna
dtype: object

In [15]:
pd.Series(["Yigit","Osman","Aleyna"],[1,2,3])

1     Yigit
2     Osman
3    Aleyna
dtype: object

In [16]:
yarıs1 = pd.Series([10,5,1],["Yigit","Osman","Aleyna"])

In [17]:
yarıs1

Yigit     10
Osman      5
Aleyna     1
dtype: int64

In [18]:
yarıs2 = pd.Series([20,10,8],["Yigit","Osman","Aleyna"])

In [19]:
yarıs2

Yigit     20
Osman     10
Aleyna     8
dtype: int64

In [21]:
yarıs2["Osman"]

10

In [22]:
sonDurum = yarıs1 + yarıs2

In [23]:
sonDurum

Yigit     30
Osman     15
Aleyna     9
dtype: int64

In [24]:
# isimler index durumunda

In [30]:
farkliSeries = pd.Series([20,30,40,50],["a","b","c","d"])

In [31]:
farkliSeries2 = pd.Series([10,5,3,1],["a","c","f","g"])

In [33]:
farkliSeries + farkliSeries2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

In [34]:
#kesisenleri yani alakalı olanları topluyor

# Data Frames

In [36]:
data = np.random.randn(4,3)

In [37]:
data

array([[ 0.32010779, -0.2689752 , -0.56347942],
       [-0.20745631, -0.76300548, -2.0155504 ],
       [ 0.10740554,  1.86372176,  0.50931929],
       [-1.25439204, -0.60284306,  0.95764963]])

In [38]:
dataFrame = pd.DataFrame(data)

In [39]:
dataFrame

          0         1         2
0  0.320108 -0.268975 -0.563479
1 -0.207456 -0.763005 -2.015550
2  0.107406  1.863722  0.509319
3 -1.254392 -0.602843  0.957650

In [40]:
dataFrame[0]

0    0.320108
1   -0.207456
2    0.107406
3   -1.254392
Name: 0, dtype: float64

In [41]:
#kolon/sütun olarak getiriyor

In [42]:
newDataFrame = pd.DataFrame(data,index=["aley","zeyno","yigit","ali"],columns=["maas","yas","calısma saatleri"])

In [43]:
newDataFrame

           maas       yas  calısma saatleri
aley   0.320108 -0.268975         -0.563479
zeyno -0.207456 -0.763005         -2.015550
yigit  0.107406  1.863722          0.509319
ali   -1.254392 -0.602843          0.957650

In [44]:
newDataFrame["yas"]

aley    -0.268975
zeyno   -0.763005
yigit    1.863722
ali     -0.602843
Name: yas, dtype: float64

In [46]:
newDataFrame["calısma saatleri"]

aley    -0.563479
zeyno   -2.015550
yigit    0.509319
ali      0.957650
Name: calısma saatleri, dtype: float64

In [47]:
newDataFrame[["maas","yas"]]

           maas       yas
aley   0.320108 -0.268975
zeyno -0.207456 -0.763005
yigit  0.107406  1.863722
ali   -1.254392 -0.602843

In [48]:
#iç içe iki dizi açarak birden fazla kolon getirebiliriz

In [49]:
newDataFrame["aley"]

KeyError: 'aley'

In [50]:
#öyle bir kolon olmadıgı için hata verdi .loc kullanmalıyım locate satır bazında

In [51]:
newDataFrame.loc["aley"]

maas                0.320108
yas                -0.268975
calısma saatleri   -0.563479
Name: aley, dtype: float64

In [52]:
newDataFrame.loc["zeyno"]

maas               -0.207456
yas                -0.763005
calısma saatleri   -2.015550
Name: zeyno, dtype: float64

In [53]:
newDataFrame.iloc[1]

maas               -0.207456
yas                -0.763005
calısma saatleri   -2.015550
Name: zeyno, dtype: float64

In [54]:
# .iloc ile istenilen index in verileri getirilir

In [55]:
newDataFrame

           maas       yas  calısma saatleri
aley   0.320108 -0.268975         -0.563479
zeyno -0.207456 -0.763005         -2.015550
yigit  0.107406  1.863722          0.509319
ali   -1.254392 -0.602843          0.957650

In [56]:
#kolon eklemek istersek>

In [57]:
newDataFrame["emeklilik yasi"] = newDataFrame["yas"]+newDataFrame["yas"]

In [58]:
newDataFrame

           maas       yas  calısma saatleri  emeklilik yasi
aley   0.320108 -0.268975         -0.563479       -0.537950
zeyno -0.207456 -0.763005         -2.015550       -1.526011
yigit  0.107406  1.863722          0.509319        3.727444
ali   -1.254392 -0.602843          0.957650       -1.205686

In [63]:
#kolon silmek istersek> .drop() axis = 1 sütun

In [62]:
newDataFrame.drop("emeklilik yasi",axis = 1)

           maas       yas  calısma saatleri
aley   0.320108 -0.268975         -0.563479
zeyno -0.207456 -0.763005         -2.015550
yigit  0.107406  1.863722          0.509319
ali   -1.254392 -0.602843          0.957650

In [66]:
#axis = 0 satır ama default olarak zaten satırı siler

In [65]:
newDataFrame.drop("ali",axis = 0)

           maas       yas  calısma saatleri  emeklilik yasi
aley   0.320108 -0.268975         -0.563479       -0.537950
zeyno -0.207456 -0.763005         -2.015550       -1.526011
yigit  0.107406  1.863722          0.509319        3.727444

In [67]:
newDataFrame

           maas       yas  calısma saatleri  emeklilik yasi
aley   0.320108 -0.268975         -0.563479       -0.537950
zeyno -0.207456 -0.763005         -2.015550       -1.526011
yigit  0.107406  1.863722          0.509319        3.727444
ali   -1.254392 -0.602843          0.957650       -1.205686

In [71]:
#sanki hiç silinmemiş gibi görünüyor, bunun için inplace=True kullanmalıyız

In [69]:
newDataFrame.drop("emeklilik yasi",axis=1,inplace=True)

In [70]:
newDataFrame

           maas       yas  calısma saatleri
aley   0.320108 -0.268975         -0.563479
zeyno -0.207456 -0.763005         -2.015550
yigit  0.107406  1.863722          0.509319
ali   -1.254392 -0.602843          0.957650

In [73]:
newDataFrame.loc["aley"]["yas"]

-0.26897519583785645

In [74]:
newDataFrame.loc["aley","yas"]

-0.26897519583785645

In [75]:
newDataFrame

           maas       yas  calısma saatleri
aley   0.320108 -0.268975         -0.563479
zeyno -0.207456 -0.763005         -2.015550
yigit  0.107406  1.863722          0.509319
ali   -1.254392 -0.602843          0.957650

In [80]:
newDataFrame < 0

        maas    yas  calısma saatleri
aley   False   True              True
zeyno   True   True              True
yigit  False  False             False
ali     True   True             False

In [81]:
boolean = newDataFrame < 0

In [82]:
newDataFrame

           maas       yas  calısma saatleri
aley   0.320108 -0.268975         -0.563479
zeyno -0.207456 -0.763005         -2.015550
yigit  0.107406  1.863722          0.509319
ali   -1.254392 -0.602843          0.957650

In [83]:
newDataFrame[boolean]

           maas       yas  calısma saatleri
aley        NaN -0.268975         -0.563479
zeyno -0.207456 -0.763005         -2.015550
yigit       NaN       NaN               NaN
ali   -1.254392 -0.602843               NaN

In [84]:
newDataFrame["yas"] > 0

aley     False
zeyno    False
yigit     True
ali      False
Name: yas, dtype: bool

In [85]:
newDataFrame[newDataFrame["yas"] > 0]

           maas       yas  calısma saatleri
yigit  0.107406  1.863722          0.509319

In [86]:
newDataFrame[newDataFrame["calısma saatleri"] > 0]

           maas       yas  calısma saatleri
yigit  0.107406  1.863722          0.509319
ali   -1.254392 -0.602843          0.957650

# index değiştirme

In [87]:
newDataFrame.reset_index()

   index      maas       yas  calısma saatleri
0   aley  0.320108 -0.268975         -0.563479
1  zeyno -0.207456 -0.763005         -2.015550
2  yigit  0.107406  1.863722          0.509319
3    ali -1.254392 -0.602843          0.957650

In [88]:
newDataFrame

           maas       yas  calısma saatleri
aley   0.320108 -0.268975         -0.563479
zeyno -0.207456 -0.763005         -2.015550
yigit  0.107406  1.863722          0.509319
ali   -1.254392 -0.602843          0.957650

In [89]:
newIndexList = ["a","b","c","d"]

In [90]:
newDataFrame["yeni index"] = newIndexList

In [91]:
newDataFrame

           maas       yas  calısma saatleri yeni index
aley   0.320108 -0.268975         -0.563479          a
zeyno -0.207456 -0.763005         -2.015550          b
yigit  0.107406  1.863722          0.509319          c
ali   -1.254392 -0.602843          0.957650          d

In [92]:
newDataFrame.set_index("yeni index")

                maas       yas  calısma saatleri
yeni index
a           0.320108 -0.268975         -0.563479
b          -0.207456 -0.763005         -2.015550
c           0.107406  1.863722          0.509319
d          -1.254392 -0.602843          0.957650

In [93]:
newDataFrame

           maas       yas  calısma saatleri yeni index
aley   0.320108 -0.268975         -0.563479          a
zeyno -0.207456 -0.763005         -2.015550          b
yigit  0.107406  1.863722          0.509319          c
ali   -1.254392 -0.602843          0.957650          d

In [94]:
newDataFrame.set_index("yeni index",inplace = True)

In [95]:
newDataFrame

                maas       yas  calısma saatleri
yeni index
a           0.320108 -0.268975         -0.563479
b          -0.207456 -0.763005         -2.015550
c           0.107406  1.863722          0.509319
d          -1.254392 -0.602843          0.957650

In [96]:
newDataFrame.loc["b"]

maas               -0.207456
yas                -0.763005
calısma saatleri   -2.015550
Name: b, dtype: float64

In [97]:
# .reset_index() ve .set_index() kavramları önemli

# multi index

In [98]:
firstIndex = ["Simpson","Simpson","Simpson","South Park", "South Park","South Park"]

In [99]:
secondIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [100]:
birlesmisIndex = list(zip(firstIndex,secondIndex))

In [101]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [102]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [103]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [104]:
type(birlesmisIndex)

pandas.core.indexes.multi.MultiIndex

In [105]:
myCartoonList = [[40,"a"],[10,"b"],[30,"c"],[9,"d"],[10,"e"],[11,"f"]]

In [106]:
myCartoonListNumpy = np.array(myCartoonList)

In [107]:
myCartoonListDataFrame = pd.DataFrame(myCartoonListNumpy,index = birlesmisIndex,columns = ["yas","meslek"])

In [108]:
myCartoonListDataFrame

                   yas meslek
Simpson    Homer    40      a
           Bart     10      b
           Marge    30      c
South Park Cartman   9      d
           Kenny    10      e
           Kyle     11      f

In [109]:
myCartoonListDataFrame.loc["Simpson"]

      yas meslek
Homer  40      a
Bart   10      b
Marge  30      c

In [110]:
myCartoonListDataFrame.loc["South Park"]

        yas meslek
Cartman   9      d
Kenny    10      e
Kyle     11      f

In [111]:
myCartoonListDataFrame.loc["South Park"].loc["Kenny"]

yas       10
meslek     e
Name: Kenny, dtype: object

In [112]:
myCartoonListDataFrame.index.names = ["film adı","isim"]

In [113]:
myCartoonListDataFrame

                   yas meslek
film adı   isim
Simpson    Homer    40      a
           Bart     10      b
           Marge    30      c
South Park Cartman   9      d
           Kenny    10      e
           Kyle     11      f

# Operasyonlar

# eksik veriler

In [115]:
veriler = {"ist": [30,29,np.nan], "ank":[20,np.nan,25], "izm":[40,39,28]}
havaDurumuDataFrame = pd.DataFrame(veriler)

In [116]:
havaDurumuDataFrame

    ist   ank  izm
0  30.0  20.0   40
1  29.0   NaN   39
2   NaN  25.0   28

In [117]:
# olmayan verileri silmeye calısmak>

In [118]:
havaDurumuDataFrame.dropna()

    ist   ank  izm
0  30.0  20.0   40

In [119]:
# nan olan satırların hepsini çıkardı

In [120]:
havaDurumuDataFrame

    ist   ank  izm
0  30.0  20.0   40
1  29.0   NaN   39
2   NaN  25.0   28

In [121]:
havaDurumuDataFrame.dropna(axis=1)

   izm
0   40
1   39
2   28

In [122]:
#nan olmayan tek kolonu getirdi

In [123]:
yeniVeriler = {"ist": [30,29,np.nan], "ank":[20,np.nan,25], "izm":[40,39,28],"ant":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeriler)

In [124]:
yeniDataFrame

    ist   ank  izm   ant
0  30.0  20.0   40  45.0
1  29.0   NaN   39   NaN
2   NaN  25.0   28   NaN

In [125]:
# iki nan olanı drop et, tek nan olanı drop etme > thresh

In [126]:
yeniDataFrame.dropna(axis=1,thresh=2)

    ist   ank  izm
0  30.0  20.0   40
1  29.0   NaN   39
2   NaN  25.0   28

In [127]:
#2 veya daha fazla olanı attı

In [128]:
#boş verileri doldurmak> .fillna()

In [129]:
yeniDataFrame

    ist   ank  izm   ant
0  30.0  20.0   40  45.0
1  29.0   NaN   39   NaN
2   NaN  25.0   28   NaN

In [130]:
yeniDataFrame.fillna(20)

    ist   ank  izm   ant
0  30.0  20.0   40  45.0
1  29.0  20.0   39  20.0
2  20.0  25.0   28  20.0

# gruplandırma / groupby

In [132]:
#multi index olmadan kolondan gruplandırma yapabiliriz

In [137]:
maaslar = {"departman" : ["yazılım","yazılım","pazarlama","pazarlama","ik","ik"],
          "calısanlar" : ["aley","ali","veli","osman","zeynep","ayse"],
          "maas" : [100,150,200,250,300,350]}

In [138]:
maasDataFrame = pd.DataFrame(maaslar)

In [139]:
maasDataFrame

   departman calısanlar  maas
0    yazılım       aley   100
1    yazılım        ali   150
2  pazarlama       veli   200
3  pazarlama      osman   250
4         ik     zeynep   300
5         ik       ayse   350

In [142]:
maasGrup = maasDataFrame.groupby("departman")

In [143]:
maasDataFrame

   departman calısanlar  maas
0    yazılım       aley   100
1    yazılım        ali   150
2  pazarlama       veli   200
3  pazarlama      osman   250
4         ik     zeynep   300
5         ik       ayse   350

In [146]:
maasGrup.count() #hangi departmanda kaç kişi var kaç maaş vaar

           calısanlar  maas
departman
ik                  2     2
pazarlama           2     2
yazılım             2     2

In [147]:
maasGrup.mean() #ortalama maaş

            maas
departman
ik         325.0
pazarlama  225.0
yazılım    125.0

In [148]:
maasGrup.min()

          calısanlar  maas
departman
ik              ayse   300
pazarlama      osman   200
yazılım         aley   100

In [149]:
maasGrup.max()

          calısanlar  maas
departman
ik            zeynep   350
pazarlama       veli   250
yazılım          ali   150

In [151]:
maasGrup.describe() #tüm değerleri kendisi hesaplıyor

           maas
          count   mean        std    min    25%    50%    75%    max
departman
ik          2.0  325.0  35.355339  300.0  312.5  325.0  337.5  350.0
pazarlama   2.0  225.0  35.355339  200.0  212.5  225.0  237.5  250.0
yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

# concat / concatenation birleştirme

In [163]:
sozluk1 = {"isim": ["ali","veli","serpil","can"],
          "spor": ["koşu","yüzme","koşu","basket"],
          "kalori": [100,200,300,400]}

In [164]:
dataFrame1 = pd.DataFrame(sozluk1, index = [0,1,2,3])

In [165]:
dataFrame1

     isim    spor  kalori
0     ali    koşu     100
1    veli   yüzme     200
2  serpil    koşu     300
3     can  basket     400

In [166]:
sozluk2 = {"isim": ["osman","levo","serkan","canan"],
          "spor": ["koşu","yüzme","koşu","basket"],
          "kalori": [200,250,350,100]}

In [167]:
dataframe2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [168]:
dataframe2

     isim    spor  kalori
4   osman    koşu     200
5    levo   yüzme     250
6  serkan    koşu     350
7   canan  basket     100

In [169]:
sozluk3 = {"isim": ["ayşe","mahmut","duygu","nur"],
          "spor": ["koşu","yüzme","badminton","tenis"],
          "kalori": [300,550,200,150]}

In [170]:
dataframe3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [171]:
dataframe3

      isim       spor  kalori
8     ayşe       koşu     300
9   mahmut      yüzme     550
10   duygu  badminton     200
11     nur      tenis     150

In [173]:
pd.concat([dataFrame1,dataframe2,dataframe3], axis = 0)

      isim       spor  kalori
0      ali       koşu     100
1     veli      yüzme     200
2   serpil       koşu     300
3      can     basket     400
4    osman       koşu     200
5     levo      yüzme     250
6   serkan       koşu     350
7    canan     basket     100
8     ayşe       koşu     300
9   mahmut      yüzme     550
10   duygu  badminton     200
11     nur      tenis     150

# merge / birleştirmek, kaynaştırmak

In [183]:
#concat gidi değil, 2 ayrı tablo var evet ama ortak datalar var, bunları kaynaştırıyor.

# .merge( , , on = )  on ile ortak olan sütun/kolon üzerinden kaynaştırma sağlıyor

In [175]:
mergeSozluk1 = {"isim" : ["ahmet", "mehmet","zeynep","aley"],
               "spor" : ["koşu", "yüzme","koşu","basket"]}

In [176]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [177]:
mergeDataFrame1

     isim    spor
0   ahmet    koşu
1  mehmet   yüzme
2  zeynep    koşu
3    aley  basket

In [178]:
mergeSozluk2 = {"isim" : ["ahmet", "mehmet","zeynep","aley"],
               "kalori" : [100,200,300,250]}

In [179]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [180]:
mergeDataFrame2

     isim  kalori
0   ahmet     100
1  mehmet     200
2  zeynep     300
3    aley     250

In [181]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on = "isim")

     isim    spor  kalori
0   ahmet    koşu     100
1  mehmet   yüzme     200
2  zeynep    koşu     300
3    aley  basket     250

# ileri örnekler

In [184]:
maasSozluk = {"isimler" : ["ayşe","fatma","can","anıl"],
             "departman" : ["ik","finans","yazılım","ik"],
             "maas" : [200,300,500,700]}

In [185]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [186]:
maasDataFrame

  isimler departman  maas
0    ayşe        ik   200
1   fatma    finans   300
2     can   yazılım   500
3    anıl        ik   700

In [187]:
maasDataFrame["departman"]

0         ik
1     finans
2    yazılım
3         ik
Name: departman, dtype: object

# uniqe

In [188]:
maasDataFrame["departman"].unique()

array(['ik', 'finans', 'yazılım'], dtype=object)

In [189]:
maasDataFrame["departman"].nunique()  #number of uniqe

3

In [190]:
maasDataFrame["departman"].value_counts()

ik         2
finans     1
yazılım    1
Name: departman, dtype: int64

# apply

In [194]:
def bruttenNete(maas) :
    return maas * 0.66

In [195]:
maasDataFrame["maas"].apply(bruttenNete)

0    132.0
1    198.0
2    330.0
3    462.0
Name: maas, dtype: float64

In [196]:
maasDataFrame.isnull()

   isimler  departman   maas
0    False      False  False
1    False      False  False
2    False      False  False
3    False      False  False

# pivot table

In [197]:
yeniVeri = {"karakterler": ["South Park", "South Park", "Simpson","Simpson"],
           "karakter ismi": ["cartman","kenny","homer","bart"],
           "karakter yas": [9,10,50,20]}

In [198]:
karakterDF = pd.DataFrame(yeniVeri)

In [199]:
karakterDF

  karakterler karakter ismi  karakter yas
0  South Park       cartman             9
1  South Park         kenny            10
2     Simpson         homer            50
3     Simpson          bart            20

In [202]:
karakterDF.pivot_table(values = "karakter yas", index = ["karakterler","karakter ismi"])

                           karakter yas
karakterler karakter ismi
Simpson     bart                     20
            homer                    50
South Park  cartman                   9
            kenny                    10

In [204]:
# aynı isimde iki kişi olsa, pivot yaşların ortalamasını alıp getirir. bu istenmez
# aggfunc = np.sum ile toplayarak da getirtilebilir

# Excel ile çalışmak

In [205]:
#excel i oku>

In [209]:
dataFramee = pd.read_excel("maas.xlsx")

In [210]:
dataFramee

  Unnamed: 0  Maas   Yas  Departman
0     Aleyna   100  40.0    Yazılım
1        Can   150  50.0      Satış
2      Yiğit   200  30.0        NaN
3       Ayşe    50  10.0  Pazarlama
4       Mert   150   NaN     Finans
5      Kerem   200  25.0      Hukuk

In [212]:
doluDegerler = dataFramee.dropna()

In [213]:
doluDegerler

  Unnamed: 0  Maas   Yas  Departman
0     Aleyna   100  40.0    Yazılım
1        Can   150  50.0      Satış
3       Ayşe    50  10.0  Pazarlama
5      Kerem   200  25.0      Hukuk

In [214]:
dataFramee

  Unnamed: 0  Maas   Yas  Departman
0     Aleyna   100  40.0    Yazılım
1        Can   150  50.0      Satış
2      Yiğit   200  30.0        NaN
3       Ayşe    50  10.0  Pazarlama
4       Mert   150   NaN     Finans
5      Kerem   200  25.0      Hukuk

In [215]:
# excel e yazmak için >

In [216]:
doluDegerler.to_excel("yenimaas.xlsx")

In [217]:
## cvs formatında ise read_cvs ya da to_cvs yapılması yeterlidir